In [1]:
#create dataframe
import pandas as pd

data = {'Make': ['Toyota', 'Lexus', 'BMW', 'Hyundai'], "Model": ['Rav 4', 'Ls20', 'X3', 'Elantra'], 'Year':[2018, 2015, 2012, 2022]}

cars = pd.DataFrame(data)

ModuleNotFoundError: No module named 'pandas'

In [3]:
cars

      Make    Model  Year
0   Toyota    Rav 4  2018
1    Lexus     Ls20  2015
2      BMW       X3  2012
3  Hyundai  Elantra  2022

In [4]:


moreData = {'Make': ['Toyota', 'Lexus', 'BMW', 'Hyundai'], "Model": ['Corolla', 'Ls200', 'M3', 'Sonata'], 'Year':[2018, 2015, 2012, 2022]}
moreCars = pd.DataFrame(moreData)

pd.concat([cars,moreCars])

      Make    Model  Year
0   Toyota    Rav 4  2018
1    Lexus     Ls20  2015
2      BMW       X3  2012
3  Hyundai  Elantra  2022
0   Toyota  Corolla  2018
1    Lexus    Ls200  2015
2      BMW       M3  2012
3  Hyundai   Sonata  2022

In [5]:
price_data = {'Price': [25000, 50000, 54000, 27000], 'Seats': [5, 5, 5, 5]}

prices = pd.DataFrame(price_data)

pd.concat([cars, prices], axis=1)

      Make    Model  Year  Price  Seats
0   Toyota    Rav 4  2018  25000      5
1    Lexus     Ls20  2015  50000      5
2      BMW       X3  2012  54000      5
3  Hyundai  Elantra  2022  27000      5

In [11]:
# to get the actor data for movies, join the movies and actors dataframes

movies = pd.read_csv("movies.csv")
actors = pd.read_csv("actors.csv")

pd.merge(movies, actors, how= 'right', on='movie_id')

,movie_id,title,genre,rating,release_year,movie_id,name,age,sex
0,1,Lord of The Rings,Fantasy,PG,2015,3,Russell Crowe,55,M
1,2,Memento,Drama,PG13,2001,2,Guy Pierce,57,M

In [12]:
pd.merge(movies, actors, how= 'left', on='movie_id')

,movie_id,title,genre,rating,release_year,movie_id,name,age,sex
0,1,Lord of The Rings,Fantasy,PG,2015,3.0,Russell Crowe,55.0,M
1,2,Memento,Drama,PG13,2001,2.0,Guy Pierce,57.0,M
2,3,A Beautiful Mind,Drama,PG,208,NaN,NaN,NaN,NaN
3,4,Gladiator,Drama,PG13,2007,NaN,NaN,NaN,NaN
4,5,Pirates of The Caribbean,Fantasy,PG,2014,NaN,NaN,NaN,NaN
5,6,Legends of The Fall,Drama,PG13,1999,NaN,NaN,NaN,NaN
6,7,Pan's Labrynth,Fantasy,PG,2004,NaN,NaN,NaN,NaN
7,8,The Boy in the Striped Pajamas,Drama,PG13,2009,NaN,NaN,NaN,NaN
8,9,Schindler's List,Drama,PG13,2000,NaN,NaN,NaN,NaN
9,10,Shawshank Redemption,Drama,PG13,1989,NaN,NaN,NaN,NaN